# PDF_ThreadDeInitialize

## Description
When the thread completes clean up library usage

```pascal
FUNCTION PDF_ThreadDeInitialize : BOOLEAN;
```

```python

def vs.PDF_ThreadDeInitialize():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2014
## Category
* PDF